{
	"nav": {
		"home": "Home",
		"about": "About",
		"experience": "Experience",
		"skills": "Skills",
		"projects": "Projects"
	},
	"intro": {
		"title": "Hi, I'm Nikita.",
		"subtitle": "I am a",
		"animated": ["Frontend Developer", "UX/UI Designer"]
	},
	"about": {
		"title": "About Me",
		"paragraph1": "I'm a frontend engineer and UX/UI designer with experience in design and product development. I specialize in building responsive interfaces and scalable component systems that transform design concepts into interactive digital experiences.",
		"paragraph2": "I'm proficient in HTML, CSS, and JavaScript, and actively contribute to frontend development workflows. I have hands-on experience with React and Vue, as well as styling tools like Sass, Tailwind, styled-components, GSAP, and Quasar. I'm also familiar with API integration and Git version control.",
		"paragraph3": "With a background in design, I approach development from a user-centered perspective—ensuring visual consistency and intuitive experience logic. I enjoy exploring new technologies and best practices, continuously improving my frontend skills and bridging the gap between design and development. My work spans across e-commerce platforms, large-scale applications, and cross-functional team collaborations."
	},
	"skills": {
		"title": "Skills",
		"list": [
			"HTML",
			"CSS",
			"JavaScript",
			"Vue3",
			"React",
			"Quasar",
			"Tailwind",
			"Framer Motion",
			"Scss",
			"styled-components",
			"gsap",
			"Firebase",
			"Unity",
			"Git",
			"Figma",
			"Wix",
			"Whimsical",
			"Photoshop",
			"Draw.io",
			"Sketch",
			"Zeplin",
			"Miro",
			"Trello",
			"Jira",
			"GraphQL"
		]
	},
	"experience": {
		"graphicDesign": {
			"title": "Graphic Design",
			"location": "DeAnza College",
			"description": "Studied graphic design and became proficient in Adobe Creative Suite (Photoshop, Illustrator, InDesign)."
		},
		"ucsdVisualArt": {
			"title": "Visual Arts - Interdisciplinary",
			"location": "UC San Diego",
			"description": "Blended art and technology to approach design with creativity and precision."
		},
		"hunchTech": {
			"title": "UI/UX Designer",
			"location": "HunchTech",
			"description": "Worked on UI/UX design, game interfaces, web creation with Wix, and Firebase integration."
		},
		"nadiSystem": {
			"title": "UI/UX Designer",
			"location": "NADI System Corp.",
			"description": "Led smart factory, smart building, and telecom UI projects with Unity, Figma, and data dashboards."
		},
		"rogersAI": {
			"title": "UI/UX Designer",
			"location": "RogersAI",
			"description": "Designed internal tools and AI interfaces, ran usability testing and prototyped user flows."
		},
		"woWorld": {
			"title": "UI/UX & Frontend Developer",
			"location": "WoWorld",
			"description": "Developed responsive frontend modules and contributed to UI/UX improvements in e-commerce workflows."
		}
	},
	"projects": {
		"invoice": {
			"title": "Invoice Management App",
			"description": "A Vue 3 SPA with Firebase. Create, edit, and delete invoice records with persistent sync."
		},
		"jsModule": {
			"title": "JS Module Practice",
			"description": "Practice JavaScript modules, array methods, and DOM operations in a modular project."
		},
		"saas": {
			"title": "SaaS Landing Page",
			"description": "A modern SaaS landing page with animation, dark mode, and language toggle."
		},
		"shop": {
			"title": "Shop Products UI",
			"description": "Shopping interface with cart, sidebar quantity control, and toast confirmation after checkout."
		},
		"film": {
			"title": "Film Explorer",
			"description": "A responsive movie search app using OMDb API and a dynamic slider layout."
		}
	}
}
