{
	"nav": {
		"home": "Home",
		"about": "About Me",
		"experience": "Experience",
		"skills": "Skills",
		"projects": "Projects"
	},
	"intro": {
		"title": "Hi, I'm Nikita.",
		"subtitle": "I am a",
		"animated": ["Frontend Developer", "UX/UI Designer"]
	},
	"about": {
		"title": "About Me",
		"paragraph1": "Hi, I'm a frontend developer and UX/UI designer who loves crafting clean, accessible, and user-centric web experiences. My work bridges design and development, with a strong focus on usability, performance, and visual clarity.",
		"paragraph2": "In recent projects, I've been responsible for both the visual and frontend aspects of product development. I build responsive interfaces using Vue 3 and the Quasar framework, and I've also implemented system email features through Laravel. I specialize in turning design concepts into well-structured, maintainable code that supports a smooth user experience.",
		"paragraph3": "I've contributed to a range of products, including CRM tools, digital twin platforms, IoT dashboards, and e-commerce websites. These experiences have deepened my understanding of how system logic connects to user behavior, and how thoughtful design can bridge that gap.",
		"paragraph4": "I'm always eager to explore new tools, design systems, and technologies. I stay up-to-date with the latest trends in UX and frontend development, and I enjoy refining products by identifying user pain points and transforming feedback into meaningful improvements."
	},
	"skills": {
		"title": "Skills",
		"list": [
			"HTML",
			"CSS",
			"JavaScript",
			"Vue3",
			"React",
			"Quasar",
			"Tailwind",
			"Framer Motion",
			"Scss",
			"styled-components",
			"gsap",
			"Firebase",
			"Unity",
			"Git",
			"Figma",
			"Wix",
			"Whimsical",
			"Photoshop",
			"Draw.io",
			"Sketch",
			"Zeplin",
			"Miro",
			"Trello",
			"Jira",
			"GraphQL"
		]
	},
	"experience": {
		"graphicDesign": {
			"title": "Graphic Design",
			"location": "DeAnza College",
			"description": "Studied graphic design and became proficient in Adobe Creative Suite (Photoshop, Illustrator, InDesign)."
		},
		"ucsdVisualArt": {
			"title": "Visual Arts - Interdisciplinary",
			"location": "UC San Diego",
			"description": "Blended art and technology to approach design with creativity and precision."
		},
		"hunchTech": {
			"title": "UI/UX Designer",
			"location": "HunchTech",
			"description": "Worked on UI/UX design, game interfaces, web creation with Wix, and Firebase integration."
		},
		"nadiSystem": {
			"title": "UI/UX Designer",
			"location": "NADI System Corp.",
			"description": "Led smart factory, smart building, and telecom UI projects with Unity, Figma, and data dashboards."
		},
		"rogersAI": {
			"title": "UI/UX Designer",
			"location": "RogersAI",
			"description": "Designed internal tools and AI interfaces, ran usability testing and prototyped user flows."
		},
		"woWorld": {
			"title": "UI/UX & Frontend Developer",
			"location": "WoWorld",
			"description": "Developed responsive frontend modules and contributed to UI/UX improvements in e-commerce workflows."
		}
	},
	"projects": {
		"invoice": {
			"title": "Invoice App",
			"description": "In this invoice app, users can create, edit, and delete invoice records. All data is stored in Firebase."
		},
		"jsModule": {
			"title": "JS Module",
			"description": "This project showcases multiple functional modules built with vanilla JavaScript, focusing on DOM manipulation, event handling, and logic flow across UI and data interaction scenarios."
		},
		"saas": {
			"title": "SaaS Landing Page",
			"description": "A modern SaaS landing page built with Next.js and Tailwind CSS, featuring animations, dark mode, and a fully responsive layout."
		},
		"shop": {
			"title": "Shopping Website",
			"description": "A shopping cart built with JavaScript, featuring a sidebar for editing item quantities, supporting product addition, quantity adjustment, and checkout confirmation."
		},
		"film": {
			"title": "Film Explorer",
			"description": "A responsive movie search site built with the OMDb API, featuring Swiper-based sliders and real-time dynamic search."
		}
	}
}
