{
	"nav": {
		"home": "Home",
		"about": "About Me",
		"experience": "Experience",
		"skills": "Skills",
		"projects": "Projects"
	},
	"intro": {
		"title": "Hi, I'm Nikita.",
		"subtitle": "I am a",
		"animated": ["Frontend Developer", "UX/UI Designer"],
		"viewProjects": "View Projects"
	},
	"about": {
		"title": "About Me",
		"paragraph1": "Hi, I'm a frontend developer and UX/UI designer who loves crafting clean, accessible, and user-centric web experiences. My work bridges design and development, with a strong focus on usability, performance, and visual clarity.",
		"paragraph2": "In recent projects, I've been responsible for both the visual and frontend aspects of product development. I build responsive interfaces using Vue 3 and the Quasar framework, and I've also implemented system email features through Laravel. I specialize in turning design concepts into well-structured, maintainable code that supports a smooth user experience.",
		"paragraph3": "I've contributed to a range of products, including CRM tools, digital twin platforms, IoT dashboards, and e-commerce websites. These experiences have deepened my understanding of how system logic connects to user behavior, and how thoughtful design can bridge that gap.",
		"paragraph4": "I'm always eager to explore new tools, design systems, and technologies. I stay up-to-date with the latest trends in UX and frontend development, and I enjoy refining products by identifying user pain points and transforming feedback into meaningful improvements."
	},
	"experience": {
		"work": "Working Experience",
		"education": "Education Journey",
		"graphicDesign": {
			"title": "Graphic Design",
			"location": "De Anza College",
			"description": "Gained a strong foundation in visual communication and became proficient in Adobe Creative Suite, including Photoshop, Illustrator, and InDesign."
		},
		"ucsdVisualArt": {
			"title": "Visual Arts – Interdisciplinary Computer & Art",
			"location": "UC San Diego",
			"description": "Explored the intersection of art and technology, applying creative thinking and technical skills to develop innovative design solutions.",
			"details": [
				{
					"title": "VR Projects (2018/08)",
					"items": [
						"My Surrealism (Individual): Designed a surreal virtual environment using Unity3D, Google Blocks, and C#.",
						"Mind Constructed World (Team): Built a virtual experience game in Unity with remote transmission features, enabling players to navigate between worlds."
					]
				}
			]
		},
		"hunchTech": {
			"title": "UI/UX Designer",
			"location": "HunchTech",
			"intro": "Focused on UI/UX design, copywriting and website creation publishing by wix.",
			"details": [
				"Designed and published app landing pages using Wix and Firebase Hosting.",
				"Wrote bilingual copy and App Store listing materials."
			]
		},
		"nadiSystem": {
			"title": "UI/UX Designer",
			"location": "NADI System Corp.",
			"intro": "Worked on projects including smart building systems, data centers, digital twin platforms, and backend management tools, focusing on interface design, data visualization, interactive motion design, and prototyping.",
			"details": [
				"【FarEasTone 5G Telecom Project】Responsible for UI/UX design and data visualization, using Unity to build layouts, create interactive charts, and design a backend editing system.",
				"【Foxconn Wisconsin Project】Responsible for UI/UX and data visualization in a smart factory system, using Unity and Figma to build interfaces and create interactive prototypes.",
				"【Cathay United Bank Data Center】Responsible for UI/UX design and data visualization, using Unity to create animated and interactive interfaces.",
				"【Giant Headquarters】Contributed to UI/UX design for a smart building system, using Figma to plan interface structure and Unity to create interactive visual components.",
				"【Delta Shanghai Project】Contributed to UI/UX design for a smart building platform, focusing on data design and visualization planning."
			]
		},
		"rogersAI": {
			"title": "UI/UX Designer",
			"location": "RogersAI",
			"intro": "Responsible for UI/UX design of a 3D facial recognition system and IoT-based backend platform, along with several related projects, covering information architecture, component systems, and interaction flows.",
			"details": [
				"Conducted usability testing and A/B testing to optimize user flows.",
				"Designed component systems and modules, providing clear Figma specifications.",
				"Created interactive prototypes to validate user flows and design hypotheses."
			]
		},
		"woWorld": {
			"title": "UI/UX & Frontend Developer",
			"location": "WoWorld Marketing Co., Ltd.",
			"intro": "Worked on UI/UX design and frontend development for an e-commerce platform to improve the overall user experience.",
			"details": [
				"Developed reusable frontend components and layouts using Vue 3 and Quasar.",
				"Participated in UI/UX design and implemented the login page interface.",
				"Optimized user flows and interactions based on A/B testing results.",
				"Created system email modules using Laravel."
			]
		}
	},
	"projects": {
		"invoice": {
			"title": "Invoice App",
			"description": "In this invoice app, users can create, edit, and delete invoice records. All data is stored in Firebase."
		},
		"jsModule": {
			"title": "JS Module",
			"description": "This project showcases multiple functional modules built with vanilla JavaScript, focusing on DOM manipulation, event handling, and logic flow across UI and data interaction scenarios."
		},
		"saas": {
			"title": "SaaS Landing Page",
			"description": "A modern SaaS landing page built with Next.js and Tailwind CSS, featuring animations, dark mode, and a fully responsive layout."
		},
		"shop": {
			"title": "Shopping Website",
			"description": "A shopping cart built with JavaScript, featuring a sidebar for editing item quantities, supporting product addition, quantity adjustment, and checkout confirmation."
		},
		"film": {
			"title": "Film Explorer",
			"description": "A responsive movie search site built with the OMDb API, featuring Swiper-based sliders and real-time dynamic search."
		}
	}
}
